src/main/test/artillery/shorts/get_followers.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest
  plugins:
    expect: { }
    metrics-by-endpoint: {}
  phases:
    - name: simple_post
      duration: 1
      arrivalRate: 1
  payload:
    path: ../data/random_users.csv
    order: sequence
    skipHeader: true
    delimiter: ","
    skipEmptyLines: true
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"

scenarios:
  - name: follow
    flow:
      - log: "Following user 'star'"
      - post:
          url: /users/login
          headers:
            Content-Type: application/x-www-form-urlencoded
          body: "userId={{userId}}&pwd={{pwd}}"
          expect:
            - statusCode: 200
      - post:
          url: /users/login
          headers:
            Content-Type: application/x-www-form-urlencoded
          body: "userId=star&pwd=pwdofastar"
          expect:
            - statusCode: 200
      - log: "get 'star' followers"
      - get:
          url: /shorts/star/followers
          capture:
            json: '$'
            as: followersResponse
          expect:
            - statusCode: 200
            - contentType: json
            - equals:
                - '25'
                - '{{ followersResponse.length }}'
      - log: "get followers successful"