src/main/test/artillery/shorts/get_followers.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest
  plugins:
    expect: { }
    metrics-by-endpoint: {}
  phases:
    - name: follow star
      duration: 25
      arrivalRate: 1

scenarios:
  - name: follow
    flow:
      - post:
          url: /users/login
          headers:
            Content-Type: application/x-www-form-urlencoded
          body: "userId=star&pwd=pwdofastar"
          expect:
            - statusCode: 200
      - log: "get 'star' followers"
      - get:
          url: /shorts/star/followers
          capture:
            json: '$'
            as: followersResponse
          expect:
            - statusCode: 200
            - contentType: json
            - equals:
                - '25'
                - '{{ followersResponse.length }}'
      - log: "get followers successful"