src/main/test/artillery/shorts/get_short.yaml
config:
  target: '{{ $env.SERVER_URI }}'
  processor: "./shorts-utils.js"
  plugins:
    expect: { }
    metrics-by-endpoint: {}
  phases:
    - name: simple_post
      duration: 25
      arrivalRate: 1
  payload:
    path: ../data/random_users.csv
    order: sequence
    skipHeader: true
    delimiter: ","
    skipEmptyLines: true
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: create a short
    flow:
      - post:
          url: /users/login
          expect:
            - statusCode: 200
          headers:
            Content-Type: application/x-www-form-urlencoded
          body: "userId={{ userId }}&pwd={{ pwd }}"
      - log: "Login successful, proceeding to create a short."
      - post:
          url: /shorts/{{ userId }}
          expect:
            - statusCode: 200
          capture:
            json: '$'
            as: response
      - log : "Short created successfully. Let's upload it {{ response.blobUrl }}"
      - post:
          url: "{{ response.blobUrl }}"
          expect:
            - statusCode: 204
          headers:
            Content-Type: application/octet-stream
          beforeRequest: 'addMultipartFormData'
      - log: "Short uploaded successfully. Let's delete it."
      - get:
          url: /shorts/{{ response.id }}
          expect:
            - statusCode: 200
      - log: "get short successful"